Repository: joemyams/VENDAVO-CUSTOM-TEMPLATE
Catalog: languages/*.po
Languages: de_de

source: Error 404
de_de: Fehler 404

source: Page Not Found
de_de: Seite nicht gefunden

source: The page you are looking for has moved or no longer exists.
de_de: Die von Ihnen gesuchte Seite ist umgezogen oder existiert nicht mehr.

source: Back Home
de_de: Zurück zur Homepage

source: Events Page
de_de: Veranstaltungsseite

source: All
de_de: Alle

source: Virtual
de_de: Virtuell

source: In-Person
de_de: Persönlich

source: Show Archived Events
de_de: Archivierte Ereignisse anzeigen

source: Sorry, no posts matched your criteria.
de_de: Verzeihung, keine Artikel passen auf deine Kriterien.

source: Register Now
de_de: Jetzt registrieren

source: All Rights Reserved
de_de: Alle Rechte vorbehalten

source: Customer Favorites
de_de: Kundenfavoriten

source: Featured Resources
de_de: Ausgewählte Ressourcen

source: Skip to content
de_de: Zum Inhalt springen

source: Editor's Picks
de_de: Redakteurfavoriten

source: Landing Page
de_de: Zielseite

source: The Future of the Aftermarket Organization
de_de: Die Zukunft der Aftermarket-Organisation

source: And Why You Have to Invest in it
de_de: Und warum Sie darin investieren müssen

source: Historically, the aftermarket service business in industrial companies has followed a development path that starts with “service as a necessity”, i.e. to support warranty or break-fix, but not considered as a revenue and profit-generating business worthy of focus.
de_de: Historisch gesehen hat das Aftermarket-Servicegeschäft in Industrieunternehmen einen Entwicklungspfad verfolgt, der mit „Service als Notwendigkeit“ beginnt, um Garantie oder Reparatur zu unterstützen, aber nicht als ein Umsatz- und Gewinn generierendes Geschäft betrachtet wird, das es verdient, sich zu konzentrieren.

source: Companies need to continuously invest in the aftermarket service business to ensure a more stable and recurring stream of profit. Dedicated investment in the aftermarket service business is needed to give it a chance to grow, rather than considering it an afterthought.
de_de: Unternehmen müssen kontinuierlich in das Aftermarket-Servicegeschäft investieren, um einen stabileren und wiederkehrenden Gewinnstrom zu gewährleisten. Es sind gezielte Investitionen in das Aftermarket-Servicegeschäft erforderlich, um ihm eine Wachstumschance zu geben, anstatt es als nachträglichen Einfall zu betrachten.

source: First and Last Name
de_de: Vor-und Nachname

source: Professional Title, Company Name
de_de: Berufsbezeichnung, Firmenname

source: Questions?
de_de: Fragen?

source: Speak with one of Vendavo’s friendly Solution Development Representatives
de_de: Sprechen Sie mit einem der freundlichen Vertreter von Vendavo für die Lösungsentwicklung

source: Search Page
de_de: Suchseite

source: We're Pulling Up Your Report
de_de: Wir rufen Ihren Bericht auf

source: This may take a few seconds.
de_de: Dies kann einige Sekunden dauern.

source: Industry Challenges & Vendavo Outcomes
de_de: Branchenherausforderungen und Vendavo-Ergebnisse

source: COMMERCIAL EXCELLENCE MATURITY ASSESSMENT
de_de: BEWERTUNG DER KOMMERZIELLEN EXZELLENZ

source: Here’s where you stand overall:
de_de: Hier stehen Sie insgesamt:

source: Unstructured
de_de: Unstrukturiert

source: Disciplined
de_de: Diszipliniert

source: Adaptive
de_de: Adaptiv

source: Optimized
de_de: Optimiert

source: Global HQ
de_de: Globales Hauptquartier

source: Phone:
de_de: Telefon:

source: (Option 2 for Support)
de_de: (Option 2 für Support)

source: Press Inquiries
de_de: Presseanfragen

source: For press and analyst inquiries, contact the marketing department at
de_de: Für Presse- und Analystenanfragen wenden Sie sich bitte an die Marketingabteilung unter

source: Total Annualized Expected Value of CPQ
de_de: Gesamter annualisierter Erwartungswert des CPQ

source: Get Started
de_de: Sich aufmachen

source: Editorial Contact:
de_de: Redaktioneller Kontakt:

source: No results found
de_de: Es wurden keine Ergebnisse gefunden

source: Load More
de_de: Mehr laden

source: Congratulations!
de_de: Glückwünsche!

source: You are truly leading the pack. Most or all of these areas are well-practiced and familiar to everyone in your organization.
de_de: Du führst wirklich das Rudel an. Die meisten oder alle dieser Bereiche sind gut geübt und jedem in Ihrer Organisation vertraut.

source: Exclusively Prepared For:
de_de: Exklusiv vorbereitet für:

source: Total Benefit Range
de_de: Gesamter Vorteilsbereich

source: Conservative
de_de: Konservativ

source: Expected
de_de: Erwartet

source: Your Benefits
de_de: Deine Vorteile

source: Your Benefit
de_de: Ihr Nutzen

source: What is the expected annualized value across my business process areas?
de_de: Was ist der erwartete annualisierte Wert in meinen Geschäftsprozessbereichen?

source: Range % of Sales
de_de: Bereich % des Umsatzes

source: Sales Effectiveness, Quoting Capacity
de_de: Verkaufseffektivität, Angebotskapazität

source: Go-to-Market Effectiveness
de_de: Go-to-Market-Effektivität

source: Pricing Discipline, Margin Management
de_de: Preisdisziplin, Margenmanagement

source: Back Office and Supply Chain Efficiency
de_de: Effizienz im Backoffice und in der Lieferkette

source: Go To Market Effectiveness
de_de: Gehen Sie zur Marktwirksamkeit

source: Back Office & Supply Chain Efficiency
de_de: Effizienz im Backoffice und in der Lieferkette

source: Capability Category
de_de: Fähigkeitskategorie

source: Your Scores
de_de: Ihre Ergebnisse

source: B2B Average
de_de: B2B-Durchschnitt

source: Commercial Excellence Maturity
de_de: Kommerzielle Exzellenz-Reife

source: Your Expected Benefit from improved
de_de: Ihr erwarteter Nutzen verbessert sich

source: maturity
de_de: die Reife

source: Your Answer for
de_de: Ihre Antwort für

source: Maturity Ranking
de_de: Reifegrad-Ranking

source: Annual Sales Revenue
de_de: Jahresumsatz

source: Return on Sales
de_de: Umsatzrendite

source: Addressable Revenue
de_de: Adressierbarer Umsatz

source: Analytics
de_de: Analytik

source: Price Management
de_de: Preisverwaltung

source: Price Optimization
de_de: Preisoptimierung

source: Your Ranking
de_de: Ihr Ranking

source: Real Vendavo Customer Testimonials
de_de: Echte Vendavo-Kundenreferenzen

source: Download PDF
de_de: PDF Herunterladen

source: Total Expected Value of Vendavo Pricing Solutions
de_de: Erwarteter Gesamtwert der Preislösungen von Vendavo

source: Pricing
de_de: Preisgestaltung

source: Selling
de_de: Verkauf

source: Leadership
de_de: Führung

source: Pricing Challenges
de_de: Herausforderungen bei der Preisgestaltung

source: Lack of advanced commercial pricing models
de_de: Mangel an fortschrittlichen kommerziellen Preismodellen

source: Limited spare parts profit optimization
de_de: Begrenzte Optimierung des Ersatzteilgewinns

source: Lack of understanding of perceived customer segment value
de_de: Mangelndes Verständnis des wahrgenommenen Werts des Kundensegments

source: Limited measures for profitability visibility across the value chain
de_de: Begrenzte Maßnahmen zur Transparenz der Rentabilität in der gesamten Wertschöpfungskette

source: Your commercial processes struggle with getting the optimized, winning price in front of the customer quickly
de_de: Ihre Geschäftsprozesse kämpfen damit, dem Kunden schnell den optimierten, überzeugenden Preis zu präsentieren

source: Learn More
de_de: Erfahren Sie mehr

source: Pricing Outcomes
de_de: Preisergebnisse

source: Automated Intelligent Pricing
de_de: Automatisierte intelligente Preisgestaltung

source: Dynamic Pricing
de_de: Dynamische Preisgestaltung

source: Centralized Price Management
de_de: Zentralisiertes Preismanagement

source: Market Data Management
de_de: Marktdatenverwaltung

source: Transfer Price Management
de_de: Verrechnungspreismanagement

source: List Price Management
de_de: Listenpreisverwaltung

source: Pricing Guidance
de_de: Preisberatung

source: Pricing Analytics
de_de: Preisanalyse

source: Incentive Management
de_de: Anreizmanagement

source: Read More
de_de: Weiterlesen

source: View Case Study
de_de: Fallstudie ansehen

source: Share this article
de_de: Teile diesen Artikel

source: Read Time
de_de: Lesezeit

source: About The Author
de_de: Über den Autor

source: Website
de_de: Webseite

source: Related articles:
de_de: Zum Thema passende Artikel:

source: Vendavo Glossary
de_de: Vendavo-Glossar

source: Utility Page
de_de: Utility-Seite
